app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE (lower(first_name) LIKE 'bobolino%' OR lower(last_name) LIKE 'bobolino%' OR lower(email) LIKE 'bobolino@something.com')  ORDER BY lower(email) = 'bobolino@something.com' desc, last_name asc LIMIT 10 OFFSET 0
---
  def index
  	@page_size = PAGE_SIZE
  	@customers = []
  	@page = params[:page].to_i > 0 ? params[:page].to_i : 0
    if params[:keywords].present?
    	@keywords = params[:keywords]
    	customer_search_term = CustomerSearchTerm.new( @keywords )
    	@customers = Customer.where(customer_search_term.where_clause,customer_search_term.where_args).order(customer_search_term.order).offset(PAGE_SIZE*@page).limit(PAGE_SIZE)